In [33]:
import numpy as np 
import pandas as pd 

list = ['a','b','c','d']
print(pd.Series(list))

0    a
1    b
2    c
3    d
dtype: object

In [34]:
student_list = [' Name 1' ,' Name 2', ' Name 3',' Name 4', ' Name 5',' Name 6']
marks_list = [[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78],[83,97,80,98],[90,90,80,87]]
subject_list = ['DS','AI','MPII', 'CNS'] 
df = pd.DataFrame(data = marks_list, index = student_list, columns = subject_list)
df

         DS  AI  MPII  CNS
 Name 1  67  89    68   95
 Name 2  87  94    97   76
 Name 3  77  85    99   74
 Name 4  90  89    92   78
 Name 5  83  97    80   98
 Name 6  90  90    80   87

In [35]:
df['TS'] = df['DS'] + df['AI'] + df['MPII'] + df['CNS'] 
df

         DS  AI  MPII  CNS   TS
 Name 1  67  89    68   95  319
 Name 2  87  94    97   76  354
 Name 3  77  85    99   74  335
 Name 4  90  89    92   78  349
 Name 5  83  97    80   98  358
 Name 6  90  90    80   87  347

In [36]:
df.loc[[' Name 2',' Name 3']]

         DS  AI  MPII  CNS   TS
 Name 2  87  94    97   76  354
 Name 3  77  85    99   74  335

In [44]:
df[df['AI']>90] # No student have scored above 90 in DS so the table would be empty...

         DS  AI  MPII  CNS
 Name 2  87  94    97   76
 Name 5  83  97    80   98